<a href="https://colab.research.google.com/github/dolidovich1/Mikhail-Dolidovich/blob/main/Untitled3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

### import package

In [2]:
import pandas as pd
import numpy as np
from IPython.display import display

### data import

In [3]:
data = pd.read_csv("https://archive.ics.uci.edu/ml/machine-learning-databases/glass/glass.data")
data.head(3)

   1  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.00  0.00.1  1.1
0  2  1.51761  13.89  3.60  1.36  72.73  0.48  7.83   0.0     0.0    1
1  3  1.51618  13.53  3.55  1.54  72.99  0.39  7.78   0.0     0.0    1
2  4  1.51766  13.21  3.69  1.29  72.61  0.57  8.22   0.0     0.0    1

In [4]:
names = ["Id", "RI", "Na", "Mg", "Al", "Si", "K", "Ca", "Ba", "Fe", "Class"]
data.columns = names
data = data.drop(columns=["Id"])
data.head(3)

        RI     Na    Mg    Al     Si     K    Ca   Ba   Fe  Class
0  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.0      1
1  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.0      1
2  1.51766  13.21  3.69  1.29  72.61  0.57  8.22  0.0  0.0      1

In [6]:
data['Class'].replace(
                      {
                      1: "building_windows_float_processed",
                      2: "building_windows_non_float_processed",
                      3: "vehicle_windows_float_processed",
                      4: "vehicle_windows_non_float_processed",
                      5: "containers",
                      6: "tableware",
                      7: "headlamps"
                      }, inplace=True)
data.head(3)

        RI     Na    Mg    Al  ...    Ca   Ba   Fe                             Class
0  1.51761  13.89  3.60  1.36  ...  7.83  0.0  0.0  building_windows_float_processed
1  1.51618  13.53  3.55  1.54  ...  7.78  0.0  0.0  building_windows_float_processed
2  1.51766  13.21  3.69  1.29  ...  8.22  0.0  0.0  building_windows_float_processed

[3 rows x 10 columns]

In [9]:
for col in data.columns:
  fr = np.random.randint(5,10)/100
  data.loc[data.sample(frac=fr).index, col] = np.nan
data.head(5)

        RI     Na    Mg  ...   Ba    Fe                             Class
0  1.51761  13.89  3.60  ...  0.0  0.00  building_windows_float_processed
1  1.51618  13.53  3.55  ...  0.0  0.00                               NaN
2  1.51766    NaN  3.69  ...  0.0  0.00                               NaN
3  1.51742  13.27  3.62  ...  0.0  0.00  building_windows_float_processed
4  1.51596  12.79  3.61  ...  NaN  0.26  building_windows_float_processed

[5 rows x 10 columns]

### Data vizualization

In [10]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 213 entries, 0 to 212
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   RI      196 non-null    float64
 1   Na      196 non-null    float64
 2   Mg      200 non-null    float64
 3   Al      196 non-null    float64
 4   Si      202 non-null    float64
 5   K       198 non-null    float64
 6   Ca      194 non-null    float64
 7   Ba      198 non-null    float64
 8   Fe      200 non-null    float64
 9   Class   194 non-null    object
dtypes: float64(9), object(1)
memory usage: 16.8+ KB

In [11]:
data.describe()

               RI          Na          Mg  ...          Ca          Ba         Fe
count  196.000000  196.000000  200.000000  ...  194.000000  198.000000  200.00000
mean     1.518325   13.393367    2.666200  ...    8.973660    0.183182    0.05510
std      0.003061    0.828330    1.448561  ...    1.467371    0.509586    0.09391
min      1.511150   10.730000    0.000000  ...    5.430000    0.000000    0.00000
25%      1.516528   12.877500    2.037500  ...    8.222500    0.000000    0.00000
50%      1.517650   13.280000    3.480000  ...    8.600000    0.000000    0.00000
75%      1.519060   13.815000    3.600000  ...    9.217500    0.000000    0.10000
max      1.533930   17.380000    3.980000  ...   16.190000    3.150000    0.51000

[8 rows x 9 columns]

In [16]:
display(data['Class'].describe())
print("----------------------------------------------")
display(data['Class'].value_counts())

count                                      194
unique                                       6
top       building_windows_non_float_processed
freq                                        72
Name: Class, dtype: object

----------------------------------------------

building_windows_non_float_processed    72
building_windows_float_processed        64
headlamps                               24
vehicle_windows_float_processed         16
containers                              10
tableware                                8
Name: Class, dtype: int64